# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [2]:
#Your code here; import the necessary packages
import sqlite3
import pandas as pd
conn=sqlite3.connect("data.sqlite")
cursor=conn.cursor()

In [3]:
#Your code here; create the connection and cursor

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [4]:
#Your code here; use a subquery. No join will be necessary.
query1='''select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       where customernumber in (select customernumber from orders
       where orderDate = '2003-01-31')'''
pd.read_sql_query(query1,conn)

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [30]:
#Your code here
query2= '''select productcode, productname, order_sum from products
join (select productcode, sum(quantityordered) as order_sum
from orderdetails group by productcode) using(productcode)
order by order_sum asc'''
pd.read_sql_query(query2,conn).head(2)

  productCode                 productName  order_sum
0    S18_4933       1957 Ford Thunderbird        767
1    S24_1046  1970 Chevy Chevelle SS 454        803

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [29]:
#Your code here
query3= '''select productname, count(distinct customernumber) as count from products
join (select productcode, ordernumber,customernumber from orderdetails join
(select ordernumber, customernumber from orders) using(ordernumber)) using(productcode)
group by productcode order by count desc'''
pd.read_sql_query(query3,conn).head(2)

                   productName  count
0  1992 Ferrari 360 Spider red     40
1     1952 Alpine Renault 1300     27

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [47]:
#Your code here
query4='''select employeenumber, E.officecode, city, firstname, lastname, count
from employees E, offices O, 
(select count(distinct OO.customernumber) as count from employees E1, customers C, orders OO 
where E1.employeenumber = C.salesRepEmployeeNumber
AND OO.customernumber=C.customernumber group by E1.employeenumber) as T
where E.officecode=O.officecode AND T.count<=20
'''
pd.read_sql_query(query4,conn)

    employeeNumber officeCode           city firstName   lastName  count
0             1002          1  San Francisco     Diane     Murphy      6
1             1056          1  San Francisco      Mary  Patterson      6
2             1076          1  San Francisco      Jeff   Firrelli      6
3             1088          6         Sydney   William  Patterson      6
4             1102          4          Paris    Gerard     Bondur      6
5             1143          1  San Francisco   Anthony        Bow      6
6             1165          1  San Francisco    Leslie   Jennings      6
7             1166          1  San Francisco    Leslie   Thompson      6
8             1188          2         Boston     Julie   Firrelli      6
9             1216          2         Boston     Steve  Patterson      6
10            1286          3            NYC  Foon Yue      Tseng      6
11            1323          3            NYC    George     Vanauf      6
12            1337          4          Paris      Loui     Bondur      6
13            1370          4          Paris    Gerard  Hernandez      6
14            1401          4          Paris    Pamela   Castillo      6
15            1501          7         London     Larry       Bott      6
16            1504          7         London     Barry      Jones      6
17            1611          6         Sydney      Andy     Fixter      6
18            1612          6         Sydney     Peter      Marsh      6
19            1619          6         Sydney       Tom       King      6
20            1621          5          Tokyo      Mami      Nishi      6
21            1625          5          Tokyo   Yoshimi       Kato      6
22            1702          4          Paris    Martin     Gerard      6
23            1002          1  San Francisco     Diane     Murphy      6
24            1056          1  San Francisco      Mary  Patterson      6
25            1076          1  San Francisco      Jeff   Firrelli      6
26            1088          6         Sydney   William  Patterson      6
27            1102          4          Paris    Gerard     Bondur      6
28            1143          1  San Francisco   Anthony        Bow      6
29            1165          1  San Francisco    Leslie   Jennings      6
..             ...        ...            ...       ...        ...    ...
315           1504          7         London     Barry      Jones      5
316           1611          6         Sydney      Andy     Fixter      5
317           1612          6         Sydney     Peter      Marsh      5
318           1619          6         Sydney       Tom       King      5
319           1621          5          Tokyo      Mami      Nishi      5
320           1625          5          Tokyo   Yoshimi       Kato      5
321           1702          4          Paris    Martin     Gerard      5
322           1002          1  San Francisco     Diane     Murphy      5
323           1056          1  San Francisco      Mary  Patterson      5
324           1076          1  San Francisco      Jeff   Firrelli      5
325           1088          6         Sydney   William  Patterson      5
326           1102          4          Paris    Gerard     Bondur      5
327           1143          1  San Francisco   Anthony        Bow      5
328           1165          1  San Francisco    Leslie   Jennings      5
329           1166          1  San Francisco    Leslie   Thompson      5
330           1188          2         Boston     Julie   Firrelli      5
331           1216          2         Boston     Steve  Patterson      5
332           1286          3            NYC  Foon Yue      Tseng      5
333           1323          3            NYC    George     Vanauf      5
334           1337          4          Paris      Loui     Bondur      5
335           1370          4          Paris    Gerard  Hernandez      5
336           1401          4          Paris    Pamela   Castillo      5
337           1501          7         London     Larry       Bott      5
338           1504          7         London     Barry      Jones      5
339           1611          6         Sydney      Andy     Fixter      5
340           1612          6         Sydney     Peter      Marsh      5
341           1619          6         Sydney       Tom       King      5
342           1621          5          Tokyo      Mami      Nishi      5
343           1625          5          Tokyo   Yoshimi       Kato      5
344           1702          4          Paris    Martin     Gerard      5

[345 rows x 6 columns]

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!